In [1]:
import numpy as np
import pandas as pd

### Project1 - Housing In Mexico

Here, we'll learn:

- How to organize information using basic Python data structures.
- How to import data from CSV files and clean it using the pandas library.
- How to create data visualizations like scatter and box plots.
- How to examine the relationship between two variables using correlation.

**Problem / Question:**
- Which factor, location or size, exerts a greater influence on house prices in Mexico?

**Data Collection:**

In this project, we'll work with mexico-real-esate datasets 
- Data Source: open data
- Data type: csv (#3)

**Wrangling / Preprocessing:**

**EDA:**

### Data Wrangling (Munging)

- The first part of any data science project is preparing your data, which means making sure its in the right place and format for you to conduct your analysis.

**1.1   Import**
-  The first step of any data preparation is importing your raw data and cleaning it.

In [2]:
df1 = pd.read_csv("C:/Users/CASH/Desktop/AAC_SCHOOL/Data Science/Project/MX/mexico-real-estate-1.csv")
df2 = pd.read_csv("C:/Users/CASH/Desktop/AAC_SCHOOL/Data Science/Project/MX/mexico-real-estate-2.csv")
df3 = pd.read_csv("C:/Users/CASH/Desktop/AAC_SCHOOL/Data Science/Project/MX/mexico-real-estate-3.csv")

Inspect each DataFrames: 
- By looking at its `shape` attribute. 
- Then use the `info` method to see the data types and number of missing values for each column. 
- Finally, use the `head` method to determine to look at the first five rows of your dataset.

In [5]:
df1.shape

(700, 7)

**1.2 Data Cleaning**

**Clean df1:**

In [3]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 700 entries, 0 to 699
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Unnamed: 0     700 non-null    int64
 1   property_type  700 non-null    object
 2   state          700 non-null    object
 3   lat            583 non-null    float64
 4   lon            583 non-null    float64
 5   area_m2        700 non-null    int64
 6   price_usd      700 non-null    object
dtypes: float64(2), int64(2), object(3)
memory usage: 38.4+ KB

In [6]:
df1.head()

,Unnamed: 0,property_type,state,lat,lon,area_m2,price_usd
0,1,house,Estado de México,19.560181,-99.233528,150,"$67,965.56"
1,2,house,Nuevo León,25.688436,-100.198807,186,"$63,223.78"
2,3,apartment,Guerrero,16.767704,-99.764383,82,"$84,298.37"
3,4,apartment,Guerrero,16.829782,-99.911012,150,"$94,308.80"
4,5,house,Veracruz de Ignacio de la Llave,NaN,NaN,175,"$94,835.67"

Here, we can observe that:
- There are many missed rows (NAN) in `lan` and `lon` columns
- The column `Unamed:0` should be dropped
- The data type for the `"price_usd"` column is `object` when it should be `float`. (this is because of `'$'` and `','`)

In [7]:
# Removing NaN value in the exsiting data frame, not new
df1.dropna(inplace=True)
# Drop the first column
df1.drop(columns=["Unnamed: 0"],inplace=True)

# Transorm price from object to float
df1["price_usd"]=(
    df1["price_usd"]
    .str.replace("$","",regex=False)
    .str.replace(",","")
    .astype(float)
)

In [8]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 583 entries, 0 to 699
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   property_type  583 non-null    object
 1   state          583 non-null    object
 2   lat            583 non-null    float64
 3   lon            583 non-null    float64
 4   area_m2        583 non-null    int64
 5   price_usd      583 non-null    float64
dtypes: float64(3), int64(1), object(2)
memory usage: 31.9+ KB

NB:
- `replace(source, replacement, count)`- is a method associated with strings that allows you to replace occurrences of a substring (source) with another substring (replacement). Optionally, you can specify the maximum number of replacements to make with the count parameter (default is all occurrences).
- regex=False: This is an optional argument for the replace() method. It specifies whether to treat the source string as a literal string (False) or a regular expression (True). Here, regex=False indicates we're dealing with a plain string, not a pattern.

In [ ]:
original_string = "This string has $10 and $20."
modified_string = original_string.replace("$", "")
print(modified_string)  # Output: This string has 10 and 20.

**Clean df2:**

In [9]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 700 entries, 0 to 699
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Unnamed: 0     700 non-null    int64
 1   property_type  700 non-null    object
 2   state          700 non-null    object
 3   lat            571 non-null    float64
 4   lon            571 non-null    float64
 5   area_m2        700 non-null    int64
 6   price_mxn      700 non-null    int64
dtypes: float64(2), int64(3), object(2)
memory usage: 38.4+ KB

Here, we can notice:
- There are many null values (NAN) in `lan` and `lon` columns
- The column `Unamed:0` should be dropped
- The data type for the `"price_mxn"` column is `int64`. (but should be in US dollar `"price_usd"`)
    - If we want to compare all the home prices in this dataset, they all need to be in the same currency.
- Drop `"price_mxn"` column

In [10]:
df2.dropna(inplace=True)
df2.drop(columns=["Unnamed: 0"],inplace=True)

# Create price_usd column dividing by 16.74
df2["price_usd"]=(df2["price_mxn"]/16.68).round(2)
df2.drop(columns=["price_mxn"],inplace=True)
df2.head()

  property_type             state        lat         lon  area_m2  price_usd
0     apartment        Nuevo León  25.721081 -100.345581       72   77937.65
2         house           Morelos  23.634501 -102.552788      360  317745.80
6     apartment  Estado de México  19.272040  -99.572013       85   74940.05
7         house   San Luis Potosí  22.138882 -100.996510      158  127098.32
8     apartment  Distrito Federal  19.394558  -99.129707       65   45455.04

In [11]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 571 entries, 0 to 699
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   property_type  571 non-null    object
 1   state          571 non-null    object
 2   lat            571 non-null    float64
 3   lon            571 non-null    float64
 4   area_m2        571 non-null    int64
 5   price_usd      571 non-null    float64
dtypes: float64(3), int64(1), object(2)
memory usage: 31.2+ KB

**Cean df3:**

In [12]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 700 entries, 0 to 699
Data columns (total 6 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Unnamed: 0               700 non-null    int64
 1   property_type            700 non-null    object
 2   place_with_parent_names  700 non-null    object
 3   lat-lon                  582 non-null    object
 4   area_m2                  700 non-null    int64
 5   price_usd                700 non-null    float64
dtypes: float64(1), int64(2), object(3)
memory usage: 32.9+ KB

In [13]:
df3.head()

,Unnamed: 0,property_type,place_with_parent_names,lat-lon,area_m2,price_usd
0,1,apartment,|México|Distrito Federal|Gustavo A. Madero|Acu...,"19.52589,-99.151703",71,48550.59
1,2,house,|México|Estado de México|Toluca|Metepec|,"19.2640539,-99.5727534",233,168636.73
2,3,house,|México|Estado de México|Toluca|Toluca de Lerd...,"19.268629,-99.671722",300,86932.69
3,4,house,|México|Morelos|Temixco|Burgos Bugambilias|,NaN,275,263432.41
4,5,apartment,|México|Veracruz de Ignacio de la Llave|Veracruz|,"19.511938,-96.871956",84,68508.67

Here, we can notice:
- There are many null values (NAN) in `lan` and `lon` columns
- The column `Unamed:0` should be dropped
- Split `lat-lon` column into two separted column `lat` and `lon`

- Create a `State` column from `"place_with_parent_names"`
- Finally, drop the `"place_with_parent_names"` and `"lat-lon"` columns from the DataFrame

In [14]:
df3.dropna(inplace=True)
df3.drop(columns=["Unnamed: 0"],inplace=True)

# split lat-lon cln into two separted cln lat and lon
df3[["lat","lon"]]=df3["lat-lon"].str.split(",", expand=True)

df3.head()

,property_type,place_with_parent_names,lat-lon,area_m2,price_usd,lat,lon
0,apartment,|México|Distrito Federal|Gustavo A. Madero|Acu...,"19.52589,-99.151703",71,48550.59,19.52589,-99.151703
1,house,|México|Estado de México|Toluca|Metepec|,"19.2640539,-99.5727534",233,168636.73,19.2640539,-99.5727534
2,house,|México|Estado de México|Toluca|Toluca de Lerd...,"19.268629,-99.671722",300,86932.69,19.268629,-99.671722
4,apartment,|México|Veracruz de Ignacio de la Llave|Veracruz|,"19.511938,-96.871956",84,68508.67,19.511938,-96.871956
5,house,|México|Jalisco|Guadalajara|,"20.689157,-103.366728",175,102763.00,20.689157,-103.366728

In [15]:
df3["state"]= df3["place_with_parent_names"].str.split("|", expand=True)[2]
bdf3.drop(columns=["place_with_parent_names","lat-lon"],inplace=True)

df3.head()

,property_type,area_m2,price_usd,lat,lon,state
0,apartment,71,48550.59,19.52589,-99.151703,Distrito Federal
1,house,233,168636.73,19.2640539,-99.5727534,Estado de México
2,house,300,86932.69,19.268629,-99.671722,Estado de México
4,apartment,84,68508.67,19.511938,-96.871956,Veracruz de Ignacio de la Llave
5,house,175,102763.00,20.689157,-103.366728,Jalisco

In [16]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
Index: 582 entries, 0 to 699
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   property_type  582 non-null    object
 1   area_m2        582 non-null    int64
 2   price_usd      582 non-null    float64
 3   lat            582 non-null    object
 4   lon            582 non-null    object
 5   state          582 non-null    object
dtypes: float64(1), int64(1), object(4)
memory usage: 31.8+ KB

In [20]:
df3["lat"]=df3["lon"].astype(float)
df3["lon"]=df3["lon"].astype(float)

In [21]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
Index: 582 entries, 0 to 699
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   property_type  582 non-null    object
 1   area_m2        582 non-null    int64
 2   price_usd      582 non-null    float64
 3   lat            582 non-null    float64
 4   lon            582 non-null    float64
 5   state          582 non-null    object
dtypes: float64(3), int64(1), object(2)
memory usage: 31.8+ KB

**Concatenate DataFrame**

- You have three clean DataFrames, and 
- now it's time to combine them into a single DataFrame so that you can conduct your analysis.

In [22]:
df = pd.concat([df1,df2,df3])
print(df.shape)
df.head()

(1736, 6)

  property_type             state        lat         lon  area_m2  price_usd
0         house  Estado de México  19.560181  -99.233528      150   67965.56
1         house        Nuevo León  25.688436 -100.198807      186   63223.78
2     apartment          Guerrero  16.767704  -99.764383       82   84298.37
3     apartment          Guerrero  16.829782  -99.911012      150   94308.80
5         house           Yucatán  21.052583  -89.538639      205  105191.37

In [23]:
df.reset_index()

,index,property_type,state,lat,lon,area_m2,price_usd
0,0,house,Estado de México,19.560181,-99.233528,150,67965.56
1,1,house,Nuevo León,25.688436,-100.198807,186,63223.78
2,2,apartment,Guerrero,16.767704,-99.764383,82,84298.37
3,3,apartment,Guerrero,16.829782,-99.911012,150,94308.80
4,5,house,Yucatán,21.052583,-89.538639,205,105191.37
...,...,...,...,...,...,...,...
1731,695,house,Jalisco,-103.484418,-103.484418,175,121178.91
1732,696,house,Morelos,-99.180215,-99.180215,100,47417.83
1733,697,house,Yucatán,-89.653006,-89.653006,81,39524.23
1734,698,house,San Luis Potosí,-101.032194,-101.032194,360,245050.24
1735,699,house,Estado de México,-99.558519,-99.558519,115,110667.85

In [31]:
df.reset_index(drop=True)

,property_type,state,lat,lon,area_m2,price_usd
0,house,Estado de México,19.560181,-99.233528,150,67965.56
1,house,Nuevo León,25.688436,-100.198807,186,63223.78
2,apartment,Guerrero,16.767704,-99.764383,82,84298.37
3,apartment,Guerrero,16.829782,-99.911012,150,94308.80
4,house,Yucatán,21.052583,-89.538639,205,105191.37
...,...,...,...,...,...,...
1731,house,Jalisco,-103.484418,-103.484418,175,121178.91
1732,house,Morelos,-99.180215,-99.180215,100,47417.83
1733,house,Yucatán,-89.653006,-89.653006,81,39524.23
1734,house,San Luis Potosí,-101.032194,-101.032194,360,245050.24
1735,house,Estado de México,-99.558519,-99.558519,115,110667.85

**Save/write df**

- The data is clean and in a single DataFrame, and now you need to save it as a CSV file so that you can examine it in your exploratory data analysis.

In [32]:
df.to_csv("C:/Users/CASH/Desktop/AAC_SCHOOL/Data Science/Project/MX/mexicoData_clean.csv", index=False)